{
    "product_id": "SW_AEJxPBS_2F",
    "definition": "Auroral electrojets peaks and boundaries from SECS",
    "applicable_missions": [
        "Swarm"
    ],
    "applicable_spacecraft": [
        "Swarm-A",
        "Swarm-B",
        "Swarm-C"
    ],
    "thematic_areas": [
        "Ionosphere/Magnetosphere",
        "Space Weather"
    ],
    "description": "Characterization of the auroral electrojets and auroral oval boundaries (by using SECS method).",
    "link_files_http": "https://swarm-diss.eo.esa.int/#swarm/Level2daily/Latest_baselines/AEJ/PBS",
    "link_files_ftp": "ftp://swarm-diss.eo.esa.int/Level2daily/Latest_baselines/AEJ/PBS",
    "link_vires_gui": "",
    "link_notebook": "https://notebooks.vires.services/notebooks/03h2_demo-aebs-aejxlps",
    "link_hapi": "",
    "variables_table": "Variable,Units,Description,Dim,Type\nt_Peak, ,\"Time of WEJ and EEJ peaks in the order as they appear in the satellite flight direction, UTC<sup>4</sup>\",2,CDF_EPOCH\nLatitude_Peak,deg,Geocentric latitude in ITRF of WEJ and EEJ peaks in the order as they appear in the satellite flight direction,2,CDF_DOUBLE\nLongitude_Peak,deg,Geocentric longitude in ITRF of WEJ and EEJ peaks in the order as they appear in the satellite flight direction,2,CDF_DOUBLE\nLatitude_Peak_QD,deg,QD latitude of WEJ and EEJ peaks in the order as they appear in the satellite flight direction,2,CDF_DOUBLE\nLongitude_Peak_QD,deg,QD latitude of WEJ and EEJ peaks in the order as they appear in the satellite flight direction,2,CDF_DOUBLE\nMLT_Peak,hour,Magnetic Local Time (QD) of WEJ and EEH peaks in the order as they appear in the satellite flight direction,2,CDF_DOUBLE\nJ_DF,A/km,Peaks (minimum (WEJ) and maximum (EEJ)) of the divergence-free sheet current density in semiQD<sup>1</sup> frame in the order as they appear in the satellite flight direction,2,CDF_DOUBLE\nt_EB, ,\"Time of WEJ and EEJ equatorward boundaries in the order as they appear in the satellite flight direction, UTC<sup>4</sup>\",2,CDF_EPOCH\nLatitude_EB,deg,Geocentric latitude of WEJ and EEJ equatorward boundaries in ITRF in the order as they appear in the satellite flight direction,2,CDF_DOUBLE\nLongitude_EB,deg,Geocentric longitude of WEJ and EEJ equatorward boundaries in ITRF in the order as they appear in the satellite flight direction,2,CDF_DOUBLE\nLatitude_EB_QD,deg,QD latitude of WEJ and EEJ equatorward boundaries in the order as they appear in the satellite flight direction,2,CDF_DOUBLE\nLongitude_EB_QD,deg,QD longitude of WEJ and EEJ equatorward boundaries in the order as they appear in the satellite flight direction,2,CDF_DOUBLE\nMLT_EB,hour,Magnetic Local Time (QD) of WEJ and EEJ equatorward boundaries in the order as they appear in the satellite flight direction,2,CDF_DOUBLE\nt_PB, ,\"Time of WEJ and EEJ poleward boundaries in the order as they appear in the satellite flight direction, UTC<sup>4</sup>\",2,CDF_EPOCH\nLatitude_PB,deg,Geocentric latitude of WEJ and EEJ poleward boundaries in ITRF in the order as they appear in the satellite flight direction,2,CDF_DOUBLE\nLongitude_PB,deg,Geocentric longitude of WEJ and EEJ poleward boundaries in ITRF in the order as they appear in the satellite flight direction,2,CDF_DOUBLE\nLatitude_PB_QD,deg,QD latitude of WEJ and EEJ poleward boundaries in the order as they appear in the satellite flight direction,2,CDF_DOUBLE\nLongitude_PB_QD,deg,QD longitude of WEJ and EEJ poleward boundaries in the order as they appear in the satellite flight direction,2,CDF_DOUBLE\nMLT_PB,hour,Magnetic Local Time (QD) of WEJ and EEJ poleward boundaries in the order as they appear in the satellite flight direction,2,CDF_DOUBLE\nLatitude_B,deg,Geodetic latitude of peaks (minimum and maximum) in ground magnetic field disturbance in the order as they appear in the satellite flight direction,2,CDF_DOUBLE\nLongitude_B,deg,Geodetic longitude of peaks (minimum and maximum) in ground magnetic field disturbance in the order as they appear in the satellite flight direction,2,CDF_DOUBLE\nB,nT,Maximum (first row) and minimum (second row) of ground magnetic field disturbance. First (second) column gives the north (east) component geodetic frame,\"[2, 2]\",CDF_DOUBLE\nFlags, ,Quality indicator,1,CDF_UINT2\n",
    "related_resources": "<ul>\n<li><a href=\"https://earth.esa.int/eogateway/activities/swarm-aebs\">Activity: Auroral Electrojet and auroral Boundaries estimated from Swarm observations</a></li>\n<li><a href=\"https://earth.esa.int/eogateway/documents/20142/37627/Swarm-AEBS-product-definition.pdf\">Swarm-AEBS Product Definition</a></li>\n<li><a href=\"https://earth.esa.int/eogateway/documents/20142/37627/Swarm-AEBS-processing-algorithm-description.pdf\">Swarm-AEBS Description of the Processing Algorithm</a></li>\n<li><a href=\"https://earth.esa.int/eogateway/documents/20142/37627/Validation-auroral-electrojet-auroral-boundaries-estimated-from-swarm.pdf\">Validation of Auroral Electrojet and Auroral Boundaries estimated from Swarm observations</a></li>\n</ul>\n",
    "details": "<table border=\"1\">\n<tbody>\n  <tr>\n    <td> Product identifier  </td>\n    <td> AEJxPBS_2F  </td>\n  </tr>\n  <tr>\n    <td> Definition  </td>\n    <td> High-latitude ionospheric sheet current boundary locations, the locations of minimum (WEJ) and maximum (EEJ) eastward current density in semiQD<sup>1</sup> frame, the locations of minimum and maximum ground northward magnetic field disturbance (in semiQD<sup>1</sup>).  </td>\n  </tr>\n  <tr>\n    <td> Input Data  </td>\n    <td> MAGx_LR_1B, Latest CHAOS model<sup>2</sup> including, core, lithosphere, magnetosphere and secondary currents.  </td>\n  </tr>\n  <tr>\n    <td> Input Time Span  </td>\n    <td> Up to one year  </td>\n  </tr>\n  <tr>\n    <td> Spatial representation  </td>\n    <td> One geographic and QD latitude/longitude pair for each output value. The Swarm footprints at 110 km altitude have been determined with mapping along the geomagnetic field line.  </td>\n  </tr>\n  <tr>\n    <td> Time representation  </td>\n    <td> One timestamp for each latitude/longitude pair  </td>\n  </tr>\n  <tr>\n    <td> Units  </td>\n    <td> Degrees (locations), A/km (for peak currents) and nT (for ground B)  </td>\n  </tr>\n  <tr>\n    <td> Resolution  </td>\n    <td> Full resolution (Double precision)  </td>\n  </tr>\n  <tr>\n    <td> Uncertainty  </td>\n    <td> c.f. Juusola et al., doi: 10.1002/2016JA022961  </td>\n  </tr>\n  <tr>\n    <td> Quality indicator  </td>\n    <td> Note: Flag values are specified in binary. If two or more situations occurs simultaneously, the Flag value will be a sum of the different Flags values. For more information and examples (see SW-DS-GFZ-GS-001_AEBS_DPA, Swarm-AEBS Description of the Processing Algorithm) <br>\n<table border=\"1\">\n<tbody>\n  <tr>\n    <td> Value  </td>\n    <td> Meaning  </td>\n  </tr>\n<tr>\n    <td> 0000000000000  </td>\n    <td> Both EEJ and WEJ are detected, and their current densities are zero at all boundaries.  </td>\n  </tr><tr>\n    <td> 0000000000001  </td>\n    <td> No eastward currents detected.  </td>\n  </tr><tr>\n    <td> 0000000000010  </td>\n    <td> No westward currents detected. </td>\n  </tr><tr>\n    <td> 0000000000100  </td>\n    <td> Equatorward EEJ boundary occurs at the edge of the analysis area<sup>2</sup>, and the density is larger than 20% of peak value.  </td>\n  </tr><tr>\n    <td>0000000001000  </td>\n    <td> Poleward EEJ boundary occurs at the edge of the analysis area<sup>2</sup>, and the density is larger than 20% of peak value.  </td>\n  </tr><tr>\n    <td> 0000000010000  </td>\n    <td> Equatorward WEJ boundary occurs at the edge of the analysis area<sup>2</sup>, and the density is larger than 20% of peak value.  </td>\n  </tr><tr>\n    <td> 0000000100000  </td>\n    <td> Poleward WEJ boundary occurs at the edge of the analysis area<sup>2</sup>, and the density is larger than 20% of peak value.  </td>\n  </tr><tr>\n    <td> 0000001000000  </td>\n    <td> Swarm orbit does not fully cover the predefined oval latitude range<sup>2</sup>. Latitude gap is 2 degrees or larger.  </td>\n  </tr><tr>\n    <td> 0000010000000  </td>\n    <td> Equatorward EEJ boundary occurs at the edge of the analysis area<sup>2</sup>.  </td>\n  </tr><tr>\n    <td> 0000100000000  </td>\n    <td> Poleward EEJ boundary occurs at the edge of the analysis area<sup>2</sup>.  </td>\n  </tr>\n </tr><tr>\n    <td> 0001000000000  </td>\n    <td> Equatorward WEJ boundary occurs at the edge of the analysis area<sup>2</sup>.  </td>\n  </tr>\n</tr><tr>\n    <td> 0010000000000  </td>\n    <td> Poleward WEJ boundary occurs at the edge of the analysis area<sup>2</sup>.  </td>\n  </tr>\n</tr><tr>\n    <td> 0100000000000  </td>\n    <td>Peak value of EEJ occurs at the edge of the analysis area<sup>2</sup>.  </td>\n  </tr></tr><tr>\n    <td> 1000000000000  </td>\n    <td> Peak value of WEJ occurs at the edge of the analysis area<sup>2</sup>.  </td>\n  </tr>\n</tbody>\n</table>\n </td>\n  </tr>\n  <tr>\n    <td> Data volume  </td>\n    <td> Up to 6 MB  </td>\n  </tr>\n  <tr>\n    <td> Data format  </td>\n    <td> CDF  </td>\n  </tr>\n  <tr>\n    <td> Output time span  </td>\n    <td> Up to one year<sup>4</sup>  </td>\n  </tr>\n  <tr>\n    <td> Update rate  </td>\n    <td> Daily  </td>\n  </tr>\n  <tr>\n    <td> Latency  </td>\n    <td> &lt; 1 day  </td>\n  </tr>\n  <tr>\n    <td> Notes  </td>\n    <td> <sup>1</sup> Horizontal current components will be given both in geographic frame and in a spherical frame whose north pole is defined by the QD frame (SW-DS-GFZ-GS-001_AEBS_DPA, Swarm-AEBS Description of the Processing Algorithm). The latitude and longitude of QD north pole are available in the CDF global attributes Latitude<sub>POLEQD</sub> and Longitude<sub>POLEQD</sub> respectively. These are vectors of two elements. The 1<sup>st</sup> (2<sup>nd</sup>) value is for the case when Swarm is in the northern (southern) hemisphere. <br><sup>2</sup> Version information of Input Data are available in the CDF global attributes. <br><sup>3</sup> QD latitudes from 50 to 85 (Northern hemisphere) or -50 to -85 (Southern hemisphere). Note that Swarm orbits does not always cover this area completely. <br><sup>4</sup> If only eastward current detected timestamps for westward peak and boundaries are set to time of eastward peak and predefined oval boundaries, and vice versa. <br><sup>5</sup> Ground magnetic field caused by the ionospheric currents is determined in the semiQD frame, where its horizontal part has only the North component. Geodetic vector components are derived from the minimum and maximum of that North component. <br><sup>6</sup> Product contain data from the start of the first oval crossing of the year up until the end of the last oval crossing starting that year, i.e., may contain data from the next year if oval crossing occurs around midnight on the last day of the year.\n  </td>\n  </tr>\n</tbody>\n</table>",
    "changelog": "",
    "fast_processing": ""
}