{
    "product_id": "SW_EFIx_TCT02",
    "definition": "2Hz TII cross-track dataset",
    "applicable_missions": [
        "Swarm"
    ],
    "applicable_spacecraft": [
        "Swarm-A",
        "Swarm-B",
        "Swarm-C"
    ],
    "thematic_areas": [
        "Plasma measurements",
        "Space Weather"
    ],
    "description": "TII Level 1b dataset at 2 Hz cadence containing cross-track ion measurements along with the electric field, magnetic field in the same coordinate frame",
    "link_files_http": "https://swarm-diss.eo.esa.int/#swarm/Advanced/Plasma_Data/2Hz_TII_Cross-track_Dataset/",
    "link_files_ftp": "ftp://swarm-diss.eo.esa.int/Advanced/Plasma_Data/2Hz_TII_Cross-track_Dataset/",
    "link_vires_gui": "",
    "link_notebook": "https://notebooks.vires.services/notebooks/03k2_demo-efixtct",
    "link_hapi": "",
    "variables_table": "Variable,Units,Description,Dim,Type\nTimestamp,,UT,1,CDF_EPOCH\nLatitude,degrees,Geocentric latitude.,1,CDF_REAL4\nLongitude,degrees,Geocentric longitude.,1,CDF_REAL4\nRadius,m,Geocentric radius.,1,CDF_REAL4\nQDLatitude,degrees,Quasi-dipole magnetic latitude.,1,CDF_REAL4\nMLT,hour,Magnetic local time.,1,CDF_REAL4\nVixh,m/s,Along-track ion drift from horizontal TII sensor in satellite-track coordinates.,1,CDF_REAL4\nVixh_error,m/s,Random error estimate for along-track ion drift from horizontal TII sensor in satellite-track coordinates. Negative value indicates no estimate available.,1,CDF_REAL4\nVixv,m/s,Along-track ion drift from vertical TII sensor in satellite-track coordinates.,1,CDF_REAL4\nVixv_error,m/s,Random error estimate for along-track ion drift from vertical TII sensor in satellite-track coordinates. Negative value indicates no estimate available.,1,CDF_REAL4\nViy,m/s,Cross-track horizontal ion drift from horizontal TII sensor in satellite-track coordinates.,1,CDF_REAL4\nViy_error,m/s,Random error estimate for cross-track horizontal ion drift from horizontal TII sensor in satellite-track coordinates. Negative value indicates no estimate available.,1,CDF_REAL4\nViz,m/s,Cross-track vertical ion drift from vertical TII sensor in satellite-track coordinates.,1,CDF_REAL4\nViz_error,m/s,Random error estimate for cross-track vertical ion drift from vertical TII sensor in satellite-track coordinates. Negative value indicates no estimate available.,1,CDF_REAL4\nVsatN,m/s,Satellite velocity N component in north-east-centre coordinates.,1,CDF_REAL4\nVsatE,m/s,Satellite velocity E component in north-east-centre coordinates.,1,CDF_REAL4\nVsatC,m/s,Satellite velocity C component in north-east-centre coordinates.,1,CDF_REAL4\nEhx,mV/m,\"Electric field x component in satellite-track coordinates, derived from -VxB with along-track ion drift from horizontal sensor.\",1,CDF_REAL4\nEhy,mV/m,\"Electric field y component in satellite-track coordinates, derived from -VxB with along-track ion drift from horizontal sensor.\",1,CDF_REAL4\nEhz,mV/m,\"Electric field z component in satellite-track coordinates, derived from -VxB with along-track ion drift from horizontal sensor.\",1,CDF_REAL4\nEvx,mV/m,\"Electric field x component in satellite-track coordinates, derived from -VxB with along-track ion drift from vertical sensor.\",1,CDF_REAL4\nEvy,mV/m,\"Electric field y component in satellite-track coordinates, derived from -VxB with along-track ion drift from vertical sensor.\",1,CDF_REAL4\nEvz,mV/m,\"Electric field z component in satellite-track coordinates, derived from -VxB with along-track ion drift from vertical sensor.\",1,CDF_REAL4\nBx,nT,\"Geomagnetic field x component in satellite-track coordinates, derived from the 1 Hz product.\",1,CDF_REAL4\nBy,nT,\"Geomagnetic field y component in satellite-track coordinates, derived from the 1 Hz product.\",1,CDF_REAL4\nBz,nT,\"Geomagnetic field z component in satellite-track coordinates, derived from the 1 Hz product.\",1,CDF_REAL4\nVicrx,m/s,Ion drift corotation signal x component in satellite-track coorinates. This has been removed from ion drift and electric field.,1,CDF_REAL4\nVicry,m/s,Ion drift corotation signal y component in satellite-track coorinates. This has been removed from ion drift and electric field.,1,CDF_REAL4\nVicrz,m/s,Ion drift corotation signal z component in satellite-track coorinates. This has been removed from ion drift and electric field.,1,CDF_REAL4\nQuality_flags,,\"Bitwise flag for each velocity component, where a value of 1 for a particular component signifies that calibration was successful, and that the baseline 1-sigma noise level is less than or equal to 100 m/s at 2 Hz. Electric field quality can be assessed from these flags according to -vxB. Bit0 (least significant) = Vixh, bit1 = Vixv, bit2 = Viy, bit3 = Viz. Refer to the release notes for details.\",1,CDF_UINT2\nCalibration_flags,,Information about the calibration process. Refer to the release notes for details.,1,CDF_UINT4",
    "related_resources": "",
    "details": "",
    "changelog": ""
}