{
    "product_id": "SW_FAC_TMS_2F",
    "name": "Field-aligned currents (dual-satellite A-C)",
    "thematic_areas": [
        "Ionosphere/Magnetosphere",
        "Space Weather"
    ],
    "description": "Time series of field-aligned and radial current densities along the orbit using the dual-satellite method. Field-aligned current (FAC) density is derived by the multiplication of the radial current (IRC) density with the inclination angle of the geomagnetic field. The field-aligned current density can only be calculated at latitudes, where the magnetic field is well inclined, i.e. |I| > 30°. Near the magnetic equator for magnetic inclination angles |I| < 30° FAC values are set to NaN. The radial current density can be provided along the whole orbit, except for latitudes θ>86° (near poles), where both FAC and IRC values are set to NaN. \n\nNote that the magnetic field data used for the dual-satellite method is low-pass filtered with a 3-dB cutoff period of 20 s (corresponding to a wavelength of 150 km). This step is indispensable because the lateral distance between Swarm A and Swarm C has to be taken into account.",
    "link_files_http": "https://swarm-diss.eo.esa.int/#swarm/Level2daily/Latest_baselines/FAC/TMS",
    "link_files_ftp": "ftp://swarm-diss.eo.esa.int/Level2daily/Latest_baselines/FAC/TMS",
    "link_vires_gui": "",
    "link_notebook": "",
    "link_hapi": "",
    "variables_table": "Variable,Units,Description,Dim,Type\nTimestamp,ms,\"Time, UTC\",1,CDF_EPOCH\nLatitude,degrees,\"Position in ITRF, Latitude\",1,CDF_DOUBLE\nLongitude,degrees,\"Position in ITRF, Longitude\",1,CDF_DOUBLE\nRadius,m,\"Position in ITRF, Radius\",1,CDF_DOUBLE\nIRC,uA/m2,Ionospheric radial current (IRC),1,CDF_DOUBLE\nIRC_Error,uA/m2,uncertainty of IRC,1,CDF_DOUBLE\nFAC,uA/m2,Field-aligned current (FAC),1,CDF_DOUBLE\nFAC_Error,uA/m2,uncertainty of FAC,1,CDF_DOUBLE\nFlags,-,Flags characterizing the product quality (processing flags),1,CDF_UINT4\nFlags_F,-,Flags_F passed through from L1b and accumulated for quad points,1,CDF_UINT4\nFlags_B,-,Flags_B passed through from L1b and accumulated for quad points,1,CDF_UINT4\nFlags_q,-,Flags_q passed through from L1b and accumulated for quad points,1,CDF_UINT4\n",
    "related_resources": "",
    "details": ""
}