{
    "product_id": "SW_IPDxIRR_2F",
    "name": "Contains ionospheric plasma characteristics from multiple instruments derived at 1Hz, updated daily with 24-hour timespan",
    "applicable_missions": [
        "Swarm"
    ],
    "applicable_spacecraft": [
        "Swarm-A",
        "Swarm-B",
        "Swarm-C"
    ],
    "thematic_areas": [
        "Ionosphere/Magnetosphere",
        "Space Weather"
    ],
    "description": "Time series of characteristics of the plasma density and plasma irregularities along the orbit from single satellite measurements. Time series of local plasma conditions, including background density and total electron content. Data related to geomagnetic regions in the ionosphere. Indication of severity of plasma irregularities for ground-based users provided",
    "link_files_http": "https://swarm-diss.eo.esa.int/#swarm/Level2daily/Latest_baselines/IPD/IRR",
    "link_files_ftp": "ftp://swarm-diss.eo.esa.int/Level2daily/Latest_baselines/IPD/IRR",
    "link_vires_gui": "",
    "link_notebook": "",
    "link_hapi": "",
    "variables_table": "Variable,Units,Description,Dim,Type\nTimestamp,-,CDF_EPOCH of the measurement.,1,CDF_EPOCH\nLatitude,deg,Position in ITRF - Latitude.,1,CDF_DOUBLE\nLongitude,deg,Position in ITRF - Longitude.,1,CDF_DOUBLE\nRadius,m,Position in ITRF - Radius.,1,CDF_DOUBLE\nNe,cm^-3,\"Plasma density, directly copied from the Langmuir probe files.\",1,CDF_DOUBLE\nBackground_Ne,cm^-3,\"Background density, as calculated from Ne using a percentile filter of 551 datapoints (2 Hz raw data) and 35 as the percentile.\",1,CDF_DOUBLE\nForeground_Ne,cm^-3,\"Foreground density, as calculated from ndens using a percentile filter of 7 datapoints (2 Hz raw data) and 50 as the percentile.\",1,CDF_DOUBLE\nTe,K,\"Electron temperature, directly copied from the Langmuir probe files.\",1,CDF_DOUBLE\nPCP_flag,-,\"The polar cap patch flag:  0 if the plasma density measurement occurred OUTSIDE a polar cap patch. 1 if the plasma density measurement occurred at one of the edges of a polar cap patch (no plasma velocity measurements are available). 2 if the plasma density measurement occurred at the LEADING edge of a polar cap patch. 3 if the plasma density measurement occurred at the TRAILING edge of a polar cap patch. 4 if the plasma density measurement occurred INSIDE a polar cap patch proper. When no ion drift data is available, the leading and trailing edges cannot be distinguished. In this case the polar cap patch flag is set to 4 throughout the patch proper and to 1 throughout both edges.\",1,CDF_INT4\nGrad_Ne_at_100km,cm^-3/m,The electron density gradient in a running window calculated via linear regression over 27 data points for the 2 Hz electron density data.,1,CDF_DOUBLE\nGrad_Ne_at_50km,cm^-3/m,The electron density gradient in a running window calculated via linear regression over 13 data points for the 2 Hz electron density data.,1,CDF_DOUBLE\nGrad_Ne_at_20km,cm^-3/m,The electron density gradient in a running window calculated via linear regression over 5 data points for the 2 Hz electron density data.,1,CDF_DOUBLE\nGrad_Ne_at_PCP_edge,cm^-3/m,The linear electron density gradient calculated over the edges of a patch. This variable is non-zero only at the edges of polar cap patches.,1,CDF_DOUBLE\nROD,cm^-3/s,Rate Of change of Density,1,CDF_DOUBLE\nRODI10s,cm^-3/s,Rate Of change of Density Index (RODI) is the standard deviation of ROD over 10 seconds.,1,CDF_DOUBLE\nRODI20s,cm^-3/s,Rate Of change of Density Index (RODI) is the standard deviation of ROD over 20 seconds.,1,CDF_DOUBLE\ndelta_Ne10s,cm^-3,\"Derived by subtracting Ne by its median filtered value in 10 seconds. As a result, delta_Ne10s indicates the electron density fluctuations smaller than 75 km.\",1,CDF_DOUBLE\ndelta_Ne20s,cm^-3,\"Derived by subtracting Ne by its median filtered value in 20 seconds. As a result, delta_Ne20s indicates the electron density fluctuations smaller than 150 km.\",1,CDF_DOUBLE\ndelta_Ne40s,cm^-3,\"Derived by subtracting Ne by its median filtered value in 40 seconds. As a result, delta_Ne40s indicates the electron density fluctuations smaller than 300 km.\",1,CDF_DOUBLE\nNum_GPS_satellites,-,Total number of tracked GPS satellites above 20 degrees.,1,CDF_INT4\nmVTEC,TECU,Median of VTEC from all available GPS satellites above 30 degrees.,1,CDF_DOUBLE\nmROT,TECU/s,Median of Rate Of change of TEC (ROT) from all available GPS satellites above 30 degrees.,1,CDF_DOUBLE\nmROTI10s,TECU/s,Median of Rate Of change of TEC Index (ROTI) from all available GPS satellites above 30 degrees. The ROTI of each satellite is the standard deviation of ROT over 10 seconds.,1,CDF_DOUBLE\nmROTI20s,TECU/s,Median of Rate Of change of TEC Index (ROTI) from all available GPS satellites above 30 degrees. The ROTI of each satellite is the standard deviation of ROT over 20 seconds.,1,CDF_DOUBLE\nIBI_flag,-,\"Plasma Bubble Index, copied from the level-2 Ionospheric Bubble Index product, IBIxTMS_2F. \",1,CDF_INT4\nIonosphere_region_flag,-,\"0: equator, 1: mid-latitudes; 2: auroral oval; 3: polar cap.\",1,CDF_INT4\nIPIR_index,-,\"The numeric index for plasma fluctuations and irregularities: 0-3 low, 4-5 medium, and > 6 high level of ionosphericplasma irregularities.\",1,CDF_INT4\nNe_quality_flag,-,\"Quality flag for the Ne data and the derived data from Ne, e.g., background density, foreground density etc.\",1,CDF_INT4\nTEC_STD,TECU,STD of VTEC from all GPS satellites.,1,CDF_DOUBLE\n",
    "related_resources": "",
    "details": "<table border=\"1\">\n\t<tbody>\n\t\t<tr>\n\t\t\t<td>Product identifier</td>\n\t\t\t<td>IPDxIRR_2F</td>\n\t\t</tr>\n\t\t<tr>\n\t\t\t<td>Data Access</td>\n\t\t\t<td>Can be downloaded<br />\n\t\t\tdirectly via an ftp client at <a href=\"ftp://swarm-diss.eo.esa.int/Level2daily/Latest_baselines/IPD/IRR/\">ftp://swarm-diss.eo.esa.int/Level2daily/Latest_baselines/IPD/IRR/</a><br />\n\t\t\tor via any HTTP browser at <a href=\"https://swarm-diss.eo.esa.int/#swarm%2FLevel2daily%2FLatest_baselines%2FIPD%2FIRR\">https://swarm-diss.eo.esa.int/</a></td>\n\t\t</tr>\n\t\t<tr>\n\t\t\t<td>Science Paper</td>\n\t\t\t<td>Jin Y, Spicher A, Xiong C, Clausen L, Kervalishvili G, Stolle C, Miloch W (2019), &quot;Ionospheric plasma irregularities characterized by the Swarm satellites: statistics at high latitudes&quot;, Journal of Geophysical Research: Space Physics, Vol. 124, pp. 1262&ndash;128, DOI: <a href=\"https://agupubs.onlinelibrary.wiley.com/doi/abs/10.1029/2018JA026063\">10.1029/2018JA026063</a></td>\n\t\t</tr>\n\t\t<tr>\n\t\t\t<td>Definition</td>\n\t\t\t<td><br />\n\t\t\tTime series of characteristics of the plasma density and plasma irregularities along the orbit from single satellite measurements. Time series of local plasma conditions, including background density and total electron content. Data related to geomagnetic regions in the ionosphere. Indication of severity of plasma irregularities for ground-based users provided</td>\n\t\t</tr>\n\t\t<tr>\n\t\t\t<td>Input data</td>\n\t\t\t<td>EFI_LP_1B, TECxTMS_2F, AOBxFAC_2F, IBIxTMS_2F, PCP &ndash; Polar Cap Products</td>\n\t\t</tr>\n\t\t<tr>\n\t\t\t<td>Input time span</td>\n\t\t\t<td>3 days</td>\n\t\t</tr>\n\t\t<tr>\n\t\t\t<td>Spatial representation</td>\n\t\t\t<td>Data provided along entire orbits at positions of SwA, SwB, and SwC</td>\n\t\t</tr>\n\t\t<tr>\n\t\t\t<td>Time representation</td>\n\t\t\t<td>1 second time series (the electron density data are downsampled to 1 second resolution; the timestamp of the electron density and TEC data are rounded to the nearest integer UTC seconds)</td>\n\t\t</tr>\n\t\t<tr>\n\t\t\t<td>Units</td>\n\t\t\t<td>See data format table</td>\n\t\t</tr>\n\t\t<tr>\n\t\t\t<td>Resolution</td>\n\t\t\t<td>Temporal data resolution of 1 second, density variations estimated at 0.5 second resolution</td>\n\t\t</tr>\n\t\t<tr>\n\t\t\t<td>Uncertainty</td>\n\t\t\t<td>N/A</td>\n\t\t</tr>\n\t\t<tr>\n\t\t\t<td>Quality indicator</td>\n\t\t\t<td>Quality flags are handed through from Level 1b and Level 2 processing which is used as input data</td>\n\t\t</tr>\n\t\t<tr>\n\t\t\t<td>Data volume</td>\n\t\t\t<td>ca.10 MB per day, per satellite</td>\n\t\t</tr>\n\t\t<tr>\n\t\t\t<td>Data format</td>\n\t\t\t<td>CDF</td>\n\t\t</tr>\n\t\t<tr>\n\t\t\t<td>Output time span</td>\n\t\t\t<td>1 day</td>\n\t\t</tr>\n\t\t<tr>\n\t\t\t<td>Update rate</td>\n\t\t\t<td>1 per day</td>\n\t\t</tr>\n\t\t<tr>\n\t\t\t<td>Latency</td>\n\t\t\t<td>10 min</td>\n\t\t</tr>\n\t\t<tr>\n\t\t\t<td>Notes</td>\n\t\t\t<td>The meanings of the PCP_flag are as follows: 0 if the plasma density measurement occurred outside a polar cap patch. 1 if the plasma density measurement occurred at one of the edges of a polar cap patch (no plasma velocity measurements are available). 2 if the plasma density measurement occurred at the leading edge of a polar cap patch. 3 if the plasma density measurement occurred at the trailing edge of a polar cap patch. 4 if the plasma density measurement occurred inside a polar cap patch proper. When no ion drift data is available, the leading and trailing edges cannot be distinguished. In this case the polar cap patch flag is set to 4 throughout the patch proper and to 1 throughout both edges</td>\n\t\t</tr>\n\t</tbody>\n</table>\n"
}